-- [SQL문법] 3. HR 스키마 - ERD 만들기
-- ERD란?
-- 개체-관계 다이어그램으로 개체와 개체 사이의 관계를 다이어그램으로 표현하는 방식
-- 테이블 설계 시 활용됨.

-- 테이블 설계(데이터 모델링) 단계
-- 1) 요구사항 수집 및 분석
-- 2) 개념 모델링 : 개체(테이블, 컬럼) 및 개체 사이의 관계가 추출되는 단계
--                피터첸 방식의 ERD(뼈대)가 그려짐.
-- 3) 논리 모델링 : 데이터타입, 컬럼사이즈, 제약조건 등이 결정되는 단계
--                IE 표기법의 ERD, 테이블 차트가 그려짐.
-- 4) 물리 모델링 : DB에 테이블을 생성하는 단계

-- 리버스 모델링(역모델링)
-- 기존 DB 내 테이블 정보를 기반으로 ERD를 그려주는 작업
-- DB 내 테이블의 전체 구조를 파악하기 쉬움.

-- ERD 메뉴 위치
-- [Workbench] - [Home] - [Models] - [Create EER Model from Database]








